#+TITLE: Andromeda
#+AUTHOR: Amlesh Sivanantham (zamlz)
#+ROAM_TAGS: CONFIG SOFTWARE WORKSTATION
#+CREATED: [2021-06-20 Sun 12:51]
#+LAST_MODIFIED: [2021-06-20 Sun 14:04:16]
#+STARTUP: content

* System Specs
#+begin_src shell :results verbatim
inxi -Fx -c 0
#+end_src

#+RESULTS:
#+begin_example
System:    Kernel: 5.12.12-arch1-1 x86_64 bits: 64 compiler: gcc v: 11.1.0
           Desktop: herbstluftwm 0.9.3 Distro: Arch Linux
Machine:   Type: Desktop System: Gigabyte product: X570 AORUS MASTER v: -CF serial: <filter>
           Mobo: Gigabyte model: X570 AORUS MASTER v: x.x serial: <filter>
           UEFI: American Megatrends v: F11 date: 12/06/2019
Battery:   Device-1: hidpp_battery_0 model: Logitech Wireless Mouse MX Master 3 charge: Full
           status: Discharging
CPU:       Info: 12-Core model: AMD Ryzen 9 3900X bits: 64 type: MT MCP arch: Zen 2 rev: 0 cache:
           L2: 6 MiB
           flags: avx avx2 lm nx pae sse sse2 sse3 sse4_1 sse4_2 sse4a ssse3 svm bogomips: 182473
           Speed: 2057 MHz min/max: 2200/3800 MHz boost: enabled Core speeds (MHz): 1: 2057
           2: 3595 3: 2053 4: 3595 5: 2055 6: 3600 7: 2055 8: 2202 9: 2199 10: 2200 11: 2199
           12: 2198 13: 2056 14: 2196 15: 2055 16: 2054 17: 3600 18: 2693 19: 2198 20: 2198
           21: 2199 22: 2198 23: 2200 24: 2060
Graphics:  Device-1: NVIDIA GP102 [GeForce GTX 1080 Ti] vendor: eVga.com. driver: nvidia v: 465.31
           bus-ID: 0b:00.0
           Device-2: HD Web Camera type: USB driver: snd-usb-audio,uvcvideo bus-ID: 5-4.1:4
           Display: server: X.Org 1.20.11 driver: loaded: nvidia resolution: 5120x1440~120Hz
           Message: Unable to show advanced data. Required tool glxinfo missing.
Audio:     Device-1: NVIDIA GP102 HDMI Audio vendor: eVga.com. driver: snd_hda_intel v: kernel
           bus-ID: 0b:00.1
           Device-2: AMD Starship/Matisse HD Audio vendor: Gigabyte driver: snd_hda_intel
           v: kernel bus-ID: 0d:00.4
           Device-3: Logitech G533 Gaming Headset type: USB
           driver: hid-generic,snd-usb-audio,usbhid bus-ID: 1-3:3
           Device-4: HD Web Camera type: USB driver: snd-usb-audio,uvcvideo bus-ID: 5-4.1:4
           Device-5: AKAI PROFESSIONAL LP MPK mini type: USB driver: snd-usb-audio bus-ID: 5-4.3:5
           Sound Server-1: ALSA v: k5.12.12-arch1-1 running: yes
           Sound Server-2: JACK v: 0.125.0 running: no
           Sound Server-3: PulseAudio v: 14.2 running: yes
Network:   Device-1: Intel Wi-Fi 6 AX200 driver: iwlwifi v: kernel bus-ID: 05:00.0
           IF: wlp5s0 state: up mac: <filter>
           Device-2: Intel I211 Gigabit Network vendor: Gigabyte driver: igb v: kernel port: e000
           bus-ID: 06:00.0
           IF: enp6s0 state: down mac: <filter>
           Device-3: Realtek RTL8125 2.5GbE vendor: Gigabyte driver: r8169 v: kernel port: d000
           bus-ID: 07:00.0
           IF: enp7s0 state: down mac: <filter>
Bluetooth: Device-1: N/A type: USB driver: btusb v: 0.8 bus-ID: 3-5:3
           Report: rfkill ID: hci0 rfk-id: 1 state: down bt-service: disabled rfk-block:
           hardware: no software: no address: see --recommends
Drives:    Local Storage: total: 8.22 TiB used: 3.29 TiB (40.1%)
           ID-1: /dev/nvme0n1 vendor: Samsung model: SSD 970 EVO 500GB size: 465.76 GiB
           ID-2: /dev/nvme1n1 vendor: Samsung model: SSD 970 EVO 500GB size: 465.76 GiB
           ID-3: /dev/sda type: USB vendor: Seagate model: Expansion Desk size: 7.28 TiB
           ID-4: /dev/sdb type: USB vendor: Sabrent model: SD size: 29.72 GiB
Partition: ID-1: / size: 433.63 GiB used: 35.22 GiB (8.1%) fs: ext4 dev: /dev/nvme0n1p3
           ID-2: /boot/efi size: 126 MiB used: 134 KiB (0.1%) fs: vfat dev: /dev/nvme0n1p1
Swap:      ID-1: swap-1 type: partition size: 24 GiB used: 0 KiB (0.0%) dev: /dev/nvme0n1p2
Sensors:   System Temperatures: cpu: 44.8 C mobo: 16.8 C
           Fan Speeds (RPM): N/A
Info:      Processes: 434 Uptime: 58m Memory: 15.64 GiB used: 4.65 GiB (29.7%) Init: systemd
           Compilers: gcc: 11.1.0 clang: 12.0.0 Packages: 652 Client: Unknown Client: emacs-27.2
           inxi: 3.3.04
#+end_example

* Configuration
:PROPERTIES:
:header-args:emacs-lisp: :tangle (when (equal system-name "andromeda") "~/.config/emacs/lisp/init-system.el") :comments both :mkdirp yes
:header-args:shell: :tangle (when (equal system-name "andromeda") "~/.config/xinitrc.d/system-andromeda.sh") :comments both :mkdirp yes :shebang #!/bin/sh
:END:

** Video Resolution Fix
By default, my machine does not use the max resolution for [[file:xorg.org][Xorg X11 Window System]] so we use this script to make sure that it is being set.

#+begin_src shell
xrandr \
    --output DVI-D-0 --off \
    --output HDMI-0 --off \
    --output DP-0 --mode 5120x1440 --pos 0x0 --rotate normal \
    --output DP-1 --off \
    --output DP-2 --off \
    --output DP-3 --off \
    --output DP-4 --off \
    --output DP-5 --off
#+end_src

** Org-mode LaTeX Scaling Factor
[[file:org_mode.org][Org-mode]] and [[file:org_latex_fragtog.org][Org Latex FragTog]] Don't automatically play nice with the scaling so we set it here instead.

#+begin_src emacs-lisp
(defvar zamlz/org-latex-scale-factor 2.0)
#+end_src

** Feature Provide

#+begin_src emacs-lisp
(provide 'init-system)
#+end_src
